am/OpenFOAM-10/tutorials/incompressible/pimpleFoam/RAS/TJunctionFan/0/epsilon.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [m^2 s^-3];

internalField   uniform 200;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.01;
        value           uniform 200;
    }
    outlet1
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    }
    outlet2
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    }
    defaultFaces
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 200;
    }
}


// ************************************************************************* //
